# დავალება 2      გააკეთეთ 20 მაგალითი შედარებით ოპერატორებზე(>, <, >=, =<, ==, !=)
print(100 > 59)
print(857 < 958)
print(28 >= 28)
print(273 <= 136)
print(284 == 284)
print(10 != 12)
print(489 > 244)
print(102 < 123)
print(139 <= 185)
print(109 >= 101)
print(122 == 122)
print(109 != 133)
print(103 < 101)
print(122 > 102)
print(124 >= 124)
print(984 == 985)
print(927 != 927)
print(958 <= 1034)
print(258 != 234)
print(812 < 234)














# დავალება 3       გააკეთეთ 10 მაგალითი ლოგიკურ ოპერატორებზე(and, or)
                                      
print(10 < 11 or 11 > 10)
print(139 < 23 and 103 > 397)
print(376 == 826 and 183 != 876)
print(947 >= 1846 or 291 < 298)
print(865 != 985 and 927 == 837)
print(173 < 113 or 139 >= 193)
print(132 < 172 and 123 == 123)
print(284 > 294 or 183 >= 927)
print(836 < 947 or 816 == 928)
print(736 > 836 and 827 == 743 )








 # დავალება 4    შემოიტანეთ 2 რიცხვი და შეამოწმეთ თუ ეს რიცხვები ერთმანეთის ტოლია.  ასევე შეამოწმეთ თუ პირველი შემოტანილი რიცხვი მეტია მეორე შემოტანილ რიცხვზე. სხვა შედარებითი ოპერატორებითაც შეამოწმეთ.
num1 = int(input("Enter num1"))
num2 = int(input("Enter num2"))
print(num1 == num2)
print(num1 > num2)











